// /** @file
// Package for support of IA32 family processors
//
// This package supports IA32 family processors, with CPU DXE module, CPU PEIM, CPU S3 module,
// SMM modules, related libraries, and corresponding definitions.
//
// Copyright (c) 2006 - 2016, Intel Corporation. All rights reserved.<BR>
//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
// 
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
// **/


#string STR_PACKAGE_ABSTRACT            #language en-US "Package for support of IA32 family processors"

#string STR_PACKAGE_DESCRIPTION         #language en-US "This package supports IA32 family processors, with CPU DXE module, CPU PEIM, CPU S3 module, SMM modules, related libraries, and corresponding definitions."



#string STR_gEfiCpuTokenSpaceGuid_PcdSecCoreMaxPpiSupported_PROMPT  #language en-US "Maximum number of PPIs provided by SecCore"

#string STR_gEfiCpuTokenSpaceGuid_PcdSecCoreMaxPpiSupported_HELP  #language en-US "Specifies maximum number of PPIs provided by SecCore."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMaxLogicalProcessorNumber_PROMPT  #language en-US "Maximum number of processors supported by the platform"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMaxLogicalProcessorNumber_HELP  #language en-US "Specifies maximum number of processors supported by the platform."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmApSyncTimeout_PROMPT  #language en-US "AP synchronization timeout value in SMM"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmApSyncTimeout_HELP  #language en-US "Specifies timeout value in microseconds for the BSP in SMM to wait for all APs to come into SMM."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmStackSize_PROMPT  #language en-US "Processor stack size in SMM"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmStackSize_HELP  #language en-US "Specifies stack size in bytes for each processor in SMM."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProfileSize_PROMPT  #language en-US "SMM profile data buffer size"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProfileSize_HELP  #language en-US "Specifies buffer size in bytes to save SMM profile data. The value should be a multiple of 4KB."

#string STR_gEfiCpuTokenSpaceGuid_PcdTemporaryRamBase_PROMPT  #language en-US "Temporary RAM base address"

#string STR_gEfiCpuTokenSpaceGuid_PcdTemporaryRamBase_HELP  #language en-US "Specifies the temporary RAM base address."

#string STR_gEfiCpuTokenSpaceGuid_PcdTemporaryRamSize_PROMPT  #language en-US "Temporary RAM size"

#string STR_gEfiCpuTokenSpaceGuid_PcdTemporaryRamSize_HELP  #language en-US "Specifies the temporary RAM size in bytes."

#string STR_gEfiCpuTokenSpaceGuid_PcdSecMaximumNumberOfProcessors_PROMPT  #language en-US "Maximum number of processors in SEC"

#string STR_gEfiCpuTokenSpaceGuid_PcdSecMaximumNumberOfProcessors_HELP  #language en-US "Maximum number of processors in SEC (Not used)."

#string STR_gEfiCpuTokenSpaceGuid_PcdPeiTemporaryRamStackSize_PROMPT  #language en-US "Stack size in the temporary RAM"

#string STR_gEfiCpuTokenSpaceGuid_PcdPeiTemporaryRamStackSize_HELP  #language en-US "Specifies stack size in the temporary RAM. 0 means half of TemporaryRamSize."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmCodeAccessCheckEnable_PROMPT  #language en-US "SMM Code Access Check"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmCodeAccessCheckEnable_HELP  #language en-US "Enable SMM Code Access Check? If enabled, the SMM handler cannot execute the code outside ranges defined by SMRR/SMRR2. This PCD is suggested to TRUE in production image.<BR><BR>\n"
                                                                                       "TRUE  - SMM Code Access Check will be enabled.<BR>\n"
                                                                                       "FALSE - SMM Code Access Check will be disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApInitTimeOutInMicroSeconds_PROMPT  #language en-US "Timeout for the BSP to detect all APs for the first time"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApInitTimeOutInMicroSeconds_HELP  #language en-US "Specifies timeout value in microseconds for the BSP to detect all APs for the first time."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApStackSize_PROMPT  #language en-US "AP stack size"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApStackSize_HELP  #language en-US "Specifies stack size in bytes for each AP."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureUserConfiguration_PROMPT  #language en-US "User settings for enabling/disabling processor features"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureUserConfiguration_HELP  #language en-US "Specifies user's desired settings for enabling/disabling processor features, each bit corresponding to a specific feature."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureUserConfigurationEx1_PROMPT  #language en-US "User extension1 settings for enabling/disabling processor features"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureUserConfigurationEx1_HELP  #language en-US "Specifies desired settings for enabling/disabling processor features, each bit corresponding to a specific feature."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformHighPowerLoadLineSupport_PROMPT  #language en-US "The platform supports high power load line"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformHighPowerLoadLineSupport_HELP  #language en-US "Indicates if the platform supports high power load line."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformDynamicVidSupport_PROMPT  #language en-US "Platform dynamic Vid support"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformDynamicVidSupport_HELP  #language en-US "Platform dynamic Vid support (not used)."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformType_PROMPT  #language en-US "Platform type"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformType_HELP  #language en-US "Indicates the platform type: desktop, mobile or server.<BR><BR>\n"
                                                                        "0 - desktop<BR>\n"
                                                                        "1 - mobile<BR>\n"
                                                                        "2 - server<BR>"

#string STR_gEfiCpuTokenSpaceGuid_ERR_80000001 #language en-US "Invalid value provided."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuMaxCoreFrequency_PROMPT  #language en-US "Maximum CPU core frequency in the platform"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuMaxCoreFrequency_HELP  #language en-US "Indicates the maximum CPU core frequency in the platform."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuMaxFsbFrequency_PROMPT  #language en-US "Platform CPU maximum FSB frequency"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuMaxFsbFrequency_HELP  #language en-US "Platform CPU maximum FSB frequency (not used)."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMicrocodePatchAddress_PROMPT  #language en-US "Microcode Region base address"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMicrocodePatchAddress_HELP  #language en-US "Specifies the base address of the first microcode Patch in the microcode Region."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMicrocodePatchRegionSize_PROMPT  #language en-US "Microcode Region size"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMicrocodePatchRegionSize_HELP  #language en-US "Specifies the size of the microcode Region."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIEDEnabled_PROMPT  #language en-US "Enable IED"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIEDEnabled_HELP  #language en-US "Indicates if Intel Enhanced Debug (IED) will be enabled. Note that for some processors, IED is optional. While for other processors, IED is required.<BR><BR>\n"
                                                                         "TRUE  - IED will be enabled.<BR>\n"
                                                                         "FALSE - IED will be disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIEDRamSize_PROMPT  #language en-US "IEDRAM size"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIEDRamSize_HELP  #language en-US "Specifies the IEDRAM size. Note that there is a minimum size requirement for a processor."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnergyPolicy_PROMPT  #language en-US "The Energy efficiency policy"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnergyPolicy_HELP  #language en-US "Specifies the Energy efficiency policy when Energy Performance Bias feature is enabled. 0  - indicates preference to highest performance. 15 - indicates preference to maximize energy saving."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuAcpiLvl2Addr_PROMPT  #language en-US "LVL_2 register IO port base address"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuAcpiLvl2Addr_HELP  #language en-US "Specifies the 16-bit IO port base address of the LVL_2 register visible to software."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPackageCStateLimit_PROMPT  #language en-US "The package C-State limit"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPackageCStateLimit_HELP  #language en-US "Specifies the package C-State limit."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuClockModulationDutyCycle_PROMPT  #language en-US "The encoded values for target duty cycle modulation"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuClockModulationDutyCycle_HELP  #language en-US "Specifies the On-demand clock modulation duty cycle when T-State feature is enabled."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHwCoordination_PROMPT  #language en-US "Enable HW Coordination"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHwCoordination_HELP  #language en-US "Indicates if HW Coordination is enabled when EIST feature is enabled.<BR><BR>\n"
                                                                             "TRUE  - HW Coordination will be enabled.<BR>\n"
                                                                             "FALSE - HW Coordination will be disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcuMode_PROMPT  #language en-US "The DCU (Data Cache Unit) mode"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcuMode_HELP  #language en-US "Selects the DCU (Data Cache Unit) mode.<BR><BR>\n"
                                                                      "0 - 32-KB 8-way without ECC.<BR>\n"
                                                                      "1 - 16-KB 4-way with ECC.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApLoopMode_PROMPT  #language en-US "The AP wait loop mode"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApLoopMode_HELP  #language en-US "Specifies the AP wait loop mode during POST. The value is defined as below.<BR><BR>\n"
                                                                         "1: ApInHltLoop,   AP is in the Hlt-Loop state.<BR>\n"
                                                                         "2: ApInMwaitLoop, AP is in the Mwait-Loop state.<BR>\n"
                                                                         "3: ApInRunLoop,   AP is in the Run-Loop state.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmMsrSaveStateEnable_PROMPT  #language en-US "SMM Save State uses MSRs"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmMsrSaveStateEnable_HELP  #language en-US "Enable SMM Save State in MSRs. if enabled, SMM Save State will use the MSRs instead of the memory.<BR><BR>\n"
                                                                                    "TRUE  - SMM Save State will use the MSRs.<BR>\n"
                                                                                    "FALSE - SMM Save State will use memory.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmSmrr2Base_PROMPT  #language en-US "SMRR2 base address"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmSmrr2Base_HELP  #language en-US "Specifies the SMRR2 base address.<BR><BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmSmrr2Size_PROMPT  #language en-US "SMRR2 range size"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmSmrr2Size_HELP  #language en-US "Specifies the SMRR2 range size.<BR><BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmSmrr2CacheType_PROMPT  #language en-US "SMRR2 range cache type"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmSmrr2CacheType_HELP  #language en-US "Specifies the SMRR2 range cache type. If SMRR2 is used to map a flash/ROM based handler, it would be configured as WP.<BR><BR>\n"
                                                                                "5: WP(Write Protect).<BR>\n"
                                                                                "6: WB(Write Back).<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUseDelayIndication_PROMPT  #language en-US "SMM Delay feature"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUseDelayIndication_HELP  #language en-US "Support SMM Delay feature?<BR><BR>\n"
                                                                                    "TRUE  - supported.<BR>\n"
                                                                                    "FALSE - not supported.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUseBlockIndication_PROMPT  #language en-US "SMM Block feature"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUseBlockIndication_HELP  #language en-US "Support SMM Block feature?<BR><BR>\n"
                                                                                    "TRUE  - supported.<BR>\n"
                                                                                    "FALSE - not supported.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUseSmmEnableIndication_PROMPT  #language en-US "SMM Enable/Disable feature"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUseSmmEnableIndication_HELP  #language en-US "Support SMM Enable/Disable feature?<BR><BR>\n"
                                                                                        "TRUE  - supported.<BR>\n"
                                                                                        "FALSE - not supported.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuTccActivationOffset_PROMPT  #language en-US "TCC Activation Offset value"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuTccActivationOffset_HELP  #language en-US "Specifies the TCC Activation Offset value.<BR><BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProtectedModeEnable_PROMPT  #language en-US "SMM PROT MODE feature"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProtectedModeEnable_HELP  #language en-US "Indidates if SMM PROT MODE feature is supported.<BR><BR>\n"
                                                                                     "TRUE  - SMM PROT MODE feature is supported.<BR>\n"
                                                                                     "FALSE - SMM PROT MODE feature is not supported.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPrescottFamilyFlag_PROMPT  #language en-US "CPU MP driver Processor Family"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPrescottFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Pentium(R) 4 (90nm) processor with HT Technology, Intel(R) Celeron D Processor, Intel(R) Pentium(R) 4 Processor Extreme Edition Supporting HT Technology Processor, and Mobile Intel(R) Pentium(R) 4 Processor supporting HT Technology is included in the CPU MP driver.<BR><BR>\n"
                                                                                 "TRUE  - The support is included in the CPU MP driver.<BR>\n"
                                                                                 "FALSE - The support is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuCedarMillFamilyFlag_PROMPT  #language en-US "CPU MP driver Intel(R) Pentium(R) 4 (65nm) processor supporting HT Technology and Intel(R) Celeron D Processor Support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuCedarMillFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Pentium(R) 4 (65nm) processor supporting HT Technology and Intel(R) Celeron D Processor is included in the CPU MP driver.<BR><BR>\n"
                                                                                  "TRUE  - The support is included in the CPU MP driver.<BR>\n"
                                                                                  "FALSE - The support is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuConroeFamilyFlag_PROMPT  #language en-US "CPU MP driver Intel(R) Core(TM)2 Processor, Intel(R) Celeron(R) Processor, Intel (R) Pentium(R) Processor, and Intel(R) Xeon(R) Processor Support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuConroeFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Core(TM)2 Processor, Intel(R) Celeron(R) Processor, Intel (R) Pentium(R) Processor, and Intel(R) Xeon(R) Processor is included in the CPU MP driver.<BR><BR>\n"
                                                                               "TRUE  - The support is included in the CPU MP driver.<BR>\n"
                                                                               "FALSE - The support is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuTunnelCreekFamilyFlag_PROMPT  #language en-US "CPU MP driver Intel(R) Atom(TM) E6xx processor family Support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuTunnelCreekFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Atom(TM) E6xx processor family is included in the CPU MP driver.<BR><BR>\n"
                                                                                    "TRUE  - The support for Intel(R) Atom(TM) E6xx processor family is included in the CPU MP driver.<BR>\n"
                                                                                    "FALSE - The support for Intel(R) Atom(TM) E6xx processor family is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuNehalemFamilyFlag_PROMPT  #language en-US "CPU MP driver Intel(R) Xeon(R) Processor family (45nm QPI) Support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuNehalemFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Xeon(R) (45nm QPI) processor family is included in the CPU MP driver.<BR><BR>\n"
                                                                                "TRUE  - The support for Intel(R) Xeon(R) Processor family (45nm QPI)is included in the CPU MP driver.<BR>\n"
                                                                                "FALSE - The support for Intel(R) Xeon(R) Processor family (45nm QPI)is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSandyBridgeFamilyFlag_PROMPT  #language en-US "CPU MP driver Intel(R) Xeon(R) Processor, Intel (R) Pentium(R) Processor, Intel(R) Core(TM) Processor, Intel(R) Celeron(R) Processor Support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSandyBridgeFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Core(TM) 2xxx processor family is included in the CPU MP driver.<BR><BR>\n"
                                                                                    "TRUE  - The support is included in the CPU MP driver.<BR>\n"
                                                                                    "FALSE - The support is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSilvermontFamilyFlag_PROMPT  #language en-US "CPU MP driver Intel(R) Atom(TM) C2xxx processor family Support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSilvermontFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Atom(TM) C2xxx processor family is included in the CPU MP driver.<BR><BR>\n"
                                                                                   "TRUE  - The support is included in the CPU MP driver.<BR>\n"
                                                                                   "FALSE - The support is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIvyBridgeFamilyFlag_PROMPT  #language en-US "CPU MP driver Intel(R) Xeon(R) Processor, Intel (R) Pentium(R) Processor, Intel(R) Core(TM) Processor Support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIvyBridgeFamilyFlag_HELP  #language en-US "Indicates if the support for Intel(R) Core(TM) 3xxx processor family is included in the CPU MP driver.<BR><BR>\n"
                                                                                  "TRUE  - The support is included in the CPU MP driver.<BR>\n"
                                                                                  "FALSE - The support is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHaswellFamilyFlag_PROMPT  #language en-US "CPU MP driver 4th Generation Intel(R) Core(TM) processor support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHaswellFamilyFlag_HELP  #language en-US "Indicates if the support for 4th Generation Intel(R) Core(TM) processor family is included in the CPU MP driver.<BR><BR>\n"
                                                                                "TRUE  - The support for 4th Generation Intel(R) Core(TM) processor is included in the CPU MP driver.<BR>\n"
                                                                                "FALSE - The support for 4th Generation Intel(R) Core(TM) processor is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuThermalManagementFlag_PROMPT  #language en-US "CPU MP driver thermal management features support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuThermalManagementFlag_HELP  #language en-US "Indicates if the support for thermal management features is included in the CPU MP driver. Thermal management features include TM1, TM2 and bi-directional PROCHOT.<BR><BR>\n"
                                                                                    "TRUE  - The support for thermal management features is included in the CPU MP driver.<BR>\n"
                                                                                    "FALSE - The support for thermal management features is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnhancedCStateFlag_PROMPT  #language en-US "CPU MP driver enhanced C-State feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnhancedCStateFlag_HELP  #language en-US "Indicates if the support for enhanced C-State feature (including C1e) is included in the CPU MP driver.<BR><BR>\n"
                                                                                 "TRUE  - The support for enhanced C-State feature is included in the CPU MP driver.<BR>\n"
                                                                                 "FALSE - The support for enhanced C-State feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMaxCpuIDValueLimitFlag_PROMPT  #language en-US "CPU MP driver Limit CPUID Maxval feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMaxCpuIDValueLimitFlag_HELP  #language en-US "Indicates if the support for Limit CPUID Maxval feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                     "TRUE  - The support for Limit CPUID Maxval feature is included in the CPU MP driver.<BR>\n"
                                                                                     "FALSE - The support for Limit CPUID Maxval feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMicrocodeUpdateFlag_PROMPT  #language en-US "CPU MP driver CPU microcode update support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMicrocodeUpdateFlag_HELP  #language en-US "Indicates if the support for CPU microcode update is included in the CPU MP driver.<BR><BR>\n"
                                                                                  "TRUE  - The support for CPU microcode update is included in the CPU MP driver.<BR>\n"
                                                                                  "FALSE - The support for CPU microcode update is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMachineCheckFlag_PROMPT  #language en-US "CPU MP driver Machine Check feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMachineCheckFlag_HELP  #language en-US "Indicates if the support for Machine Check feature is included in the CPU MP driver.<BR><BR>\n"
                                                                               "TRUE  - The support for Machine Check feature is included in the CPU MP driver.<BR>\n"
                                                                               "FALSE - The support for Machine Check feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSelectLfpAsBspFlag_PROMPT  #language en-US "CPU MP driver Select Least Featured Processor as BSP feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSelectLfpAsBspFlag_HELP  #language en-US "Indicates if the support for Select Least Featured Processor as BSP feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                 "TRUE  - The support for Select Least Featured Processor as BSP feature is included in the CPU MP driver.<BR>\n"
                                                                                 "FALSE - The support for Select Least Featured Processor as BSP feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmEnableBspElection_PROMPT  #language en-US "Enable BSP election in SMM"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmEnableBspElection_HELP  #language en-US "Indicates if BSP election in SMM will be enabled. If enabled, a BSP will be dynamically elected among all processors in each SMI. Otherwise, processor 0 is always as BSP in each SMI.<BR><BR>\n"
                                                                                   "TRUE  - BSP election in SMM will be enabled.<BR>\n"
                                                                                   "FALSE - BSP election in SMM will be disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEistFlag_PROMPT  #language en-US "CPU MP driver EIST feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEistFlag_HELP  #language en-US "Indicates if the support for Enhanced Intel Speed Step (EIST) feature is included in the CPU MP driver.<BR><BR>\n"
                                                                       "TRUE  - The support for EIST feature is included in the CPU MP driver.<BR>\n"
                                                                       "FALSE - The support for EIST feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuVtLtFlag_PROMPT  #language en-US "CPU MP driver VT-x and TXT initialization support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuVtLtFlag_HELP  #language en-US "Indicates if the support for VT-x and TXT initialization is included in the CPU MP driver. VT-x - Intel Virtualization Technology for IA-32 Intel Architecture. TXT - Intel(R) Trusted Execution Technology.<BR><BR>\n"
                                                                       "TRUE  - The support for VT and LT initialization is included in the CPU MP driver.<BR>\n"
                                                                       "FALSE - The support for VT and LT initialization is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuExecuteDisableBitFlag_PROMPT  #language en-US "CPU MP driver Execute Disable Bit feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuExecuteDisableBitFlag_HELP  #language en-US "Indicates if the support for Execute Disable Bit feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                    "TRUE  - The support for Execute Disable Bit feature is included in the CPU MP driver.<BR>\n"
                                                                                    "FALSE - The support for Execute Disable Bit feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuFastStringFlag_PROMPT  #language en-US "CPU MP driver Fast Strings feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuFastStringFlag_HELP  #language en-US "Indicates if the support for Fast Strings for REP MOVS and REP STOS feature is included in the CPU MP driver.<BR><BR>\n"
                                                                             "TRUE  - The support for Fast Strings feature is included in the CPU MP driver.<BR>\n"
                                                                             "FALSE - The support for Fast Strings feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHardwarePrefetcherFlag_PROMPT  #language en-US "CPU MP driver Hardware Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHardwarePrefetcherFlag_HELP  #language en-US "Indicates if the support for Hardware Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                     "TRUE  - The support for Hardware Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                                     "FALSE - The support for Hardware Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuAdjacentCacheLinePrefetchFlag_PROMPT  #language en-US "CPU MP driver Adjacent Cache Line Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuAdjacentCacheLinePrefetchFlag_HELP  #language en-US "Indicates if the support for Adjacent Cache Line Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                            "TRUE  - The support for Adjacent Cache Line Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                                            "FALSE - The support for Adjacent Cache Line Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcuPrefetcherFlag_PROMPT  #language en-US "CPU MP driver DCU Streamer Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcuPrefetcherFlag_HELP  #language en-US "Indicates if the support for DCU Streamer Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                "TRUE  - The support for DCU Streamer Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                                "FALSE - The support for DCU Streamer Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIpPrefetcherFlag_PROMPT  #language en-US "CPU MP driver DCU IP Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuIpPrefetcherFlag_HELP  #language en-US "Indicates if the support for DCU IP Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                               "TRUE  - The support for DCU IP Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                               "FALSE - The support for DCU IP Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMlcStreamerPrefetcherFlag_PROMPT  #language en-US "CPU MP driver MLC Streamer Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMlcStreamerPrefetcherFlag_HELP  #language en-US "Indicates if the support for MLC Streamer Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                        "TRUE  - The support for MLC Streamer Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                                        "FALSE - The support for MLC Streamer Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMlcSpatialPrefetcherFlag_PROMPT  #language en-US "CPU MP driver MLC Spatial Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMlcSpatialPrefetcherFlag_HELP  #language en-US "Indicates if the support for MLC Spatial Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                       "TRUE  - The support for MLC Spatial Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                                       "FALSE - The support for MLC Spatial Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuL2PrefetcherFlag_PROMPT  #language en-US "CPU MP driver L2 Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuL2PrefetcherFlag_HELP  #language en-US "Indicates if the support for L2 Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                       "TRUE  - The support for L2 Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                                       "FALSE - The support for L2 Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuL1DataPrefetcherFlag_PROMPT  #language en-US "CPU MP driver L1 Data Prefetcher feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuL1DataPrefetcherFlag_HELP  #language en-US "Indicates if the support for L1 Data Prefetcher feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                       "TRUE  - The support for L1 Data Prefetcher feature is included in the CPU MP driver.<BR>\n"
                                                                                       "FALSE - The support for L1 Data Prefetcher feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuFerrSignalBreakFlag_PROMPT  #language en-US "CPU MP driver Pending Break Enable feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuFerrSignalBreakFlag_HELP  #language en-US "Indicates if the support for Pending Break Enable feature is included in the CPU MP driver. This feature uses the FERR#/PBE# pin when the processor is in the stop-clock state to signal the processor that an interrupt is pending and that the processor should return to normal operation to handle the interrupt.<BR><BR>\n"
                                                                                  "TRUE  - The support for Pending Break Enable feature is included in the CPU MP driver.<BR>\n"
                                                                                  "FALSE - The support for Pending Break Enable feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPeciFlag_PROMPT  #language en-US "CPU MP driver Platform Environment Control Interface (PECI) feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPeciFlag_HELP  #language en-US "Is Platform Enviroment Control Interface (PECI) feature requierd the CPU MP driver?<BR><BR>\n"
                                                                       "TRUE  - The support for PECI feature is included in the CPU MP driver.<BR>\n"
                                                                       "FALSE - The support for PECI feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMonitorMwaitFlag_PROMPT  #language en-US "CPU MP driver MONITOR feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMonitorMwaitFlag_HELP  #language en-US "Indicates if the support for MONITOR (MONITOR and MWAIT instructions) feature is included in the CPU MP driver.<BR><BR>\n"
                                                                               "TRUE  - The support for MONITOR feature is included in the CPU MP driver.<BR>\n"
                                                                               "FALSE - The support for MONITOR feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuThreeStrikeCounterFlag_PROMPT  #language en-US "CPU MP driver Three Strike Counter feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuThreeStrikeCounterFlag_HELP  #language en-US "Indicates if the support for Three Strike Counter feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                     "TRUE  - The support for Three Strike Counter feature is included in the CPU MP driver.<BR>\n"
                                                                                     "FALSE - The support for Three Strike Counter feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnergyPerformanceBiasFlag_PROMPT  #language en-US "CPU MP driver CPU Energy Efficiency Policy feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnergyPerformanceBiasFlag_HELP  #language en-US "Indicates if the support for CPU Energy Efficiency Policy feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                        "TRUE  - The support for CPU Energy Efficiency Policy feature is included in the CPU MP driver.<BR>\n"
                                                                                        "FALSE - The support for CPU Energy Efficiency Policy feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuTStateFlag_PROMPT  #language en-US "CPU MP driver T-State feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuTStateFlag_HELP  #language en-US "Indicates if the support for T-State feature is included in the CPU MP driver.<BR><BR>\n"
                                                                         "TRUE  - The support for T-State feature is included in the CPU MP driver.<BR>\n"
                                                                         "FALSE - The support for T-State feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuAesFlag_PROMPT  #language en-US "CPU MP driver Advanced Encryption Standard (AES) feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuAesFlag_HELP  #language en-US "Indicates if the support for Advanced Encryption Standard (AES) feature is included in the CPU MP driver.<BR><BR>\n"
                                                                      "TRUE  - The support for AES feature is included in the CPU MP driver.<BR>\n"
                                                                      "FALSE - The support for AES feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcaFlag_PROMPT  #language en-US "CPU MP driver Direct Cache Access (DCA) feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcaFlag_HELP  #language en-US "Indicates if the support for Direct Cache Access (DCA) feature is included in the CPU MP driver.<BR><BR>\n"
                                                                      "TRUE  - The support for DCA feature is included in the CPU MP driver.<BR>\n"
                                                                      "FALSE - The support for DCA feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuCStateFlag_PROMPT  #language en-US "CPU MP driver C-State feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuCStateFlag_HELP  #language en-US "Indicates if the support for C-State feature is included in the CPU MP driver.<BR><BR>\n"
                                                                         "TRUE  - The support for C-State feature is included in the CPU MP driver.<BR>\n"
                                                                         "FALSE - The support for C-State feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuX2ApicFlag_PROMPT  #language en-US "CPU MP driver x2APIC mode support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuX2ApicFlag_HELP  #language en-US "Indicates if the support for x2APIC mode is included in the CPU MP driver.<BR><BR>\n"
                                                                         "TRUE  - The support for x2APIC mode is included in the CPU MP driver.<BR>\n"
                                                                         "FALSE - The support for x2APIC mode is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApicTprUpdateMessageFlag_PROMPT  #language en-US "CPU MP driver APIC TPR Update message feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuApicTprUpdateMessageFlag_HELP  #language en-US "Indicates if the support for APIC TPR Update message feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                       "TRUE  - The support for APIC TPR Update message feature is included in the CPU MP driver.<BR>\n"
                                                                                       "FALSE - The support for APIC TPR Update message feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcuModeSelectionFlag_PROMPT  #language en-US "CPU MP driver DCU mode selection feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuDcuModeSelectionFlag_HELP  #language en-US "Indicates if the support for Data Cache Unit (DCU) mode selection feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                   "TRUE  - The support for Data Cache Unit (DCU) mode selection feature is included in the CPU MP driver.<BR>\n"
                                                                                   "FALSE - The support for Data Cache Unit (DCU) mode selection feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuGateA20MDisableFlag_PROMPT  #language en-US "CPU MP driver A20M Disable feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuGateA20MDisableFlag_HELP  #language en-US "Indicates if the support for A20M Disable feature is included in the CPU MP driver. When the A20M #pin (Address 20 Mask) was asserted, the processor would mask physical address bit 20 (A20#). The A20M Disable can disable this legacy A20M feature.<BR><BR>\n"
                                                                                  "TRUE  - The support for A20M Disable feature is included in the CPU MP driver.<BR>\n"
                                                                                  "FALSE - The support for A20M Disable feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSocketIdReassignmentFlag_PROMPT  #language en-US "CPU MP driver CPU socket ID re-assignment feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSocketIdReassignmentFlag_HELP  #language en-US "Indicates if the support for CPU socket ID re-assignment feature is included in the CPU MP driver. This feature allows re-assignment of CPU socket ID over hardware power-on default value, which in turn changes the APIC ID of logical processors in the CPU socket.<BR><BR>\n"
                                                                                       "TRUE  - The support for CPU socket ID re-assignment feature is included in the CPU MP driver.<BR>\n"
                                                                                       "FALSE - The support for CPU socket ID re-assignment feature is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmDebug_PROMPT  #language en-US "Enable SMM Debug"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmDebug_HELP  #language en-US "Indicates if SMM Debug will be enabled. If enabled, hardware breakpoints in SMRAM can be set outside of SMM mode and take effect in SMM.<BR><BR>\n"
                                                                       "TRUE  - SMM Debug will be enabled.<BR>\n"
                                                                       "FALSE - SMM Debug will be disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmStackGuard_PROMPT  #language en-US "Enable SMM Stack Guard"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmStackGuard_HELP  #language en-US "Indicates if SMM Stack Guard will be enabled. If enabled, stack overflow in SMM can be caught, which eases debugging.<BR><BR>\n"
                                                                            "TRUE  - SMM Stack Guard will be enabled.<BR>\n"
                                                                            "FALSE - SMM Stack Guard will be disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmBlockStartupThisAp_PROMPT  #language en-US "SMM Startup AP in a blocking fashion"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmBlockStartupThisAp_HELP  #language en-US "Indicates if SMM Startup AP in a blocking fashion.\n"
                                                                                    "TRUE  - SMM Startup AP in a blocking fashion.<BR>\n"
                                                                                    "FALSE - SMM Startup AP in a non-blocking fashion.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProfileEnable_PROMPT  #language en-US "Enable SMM Profile"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProfileEnable_HELP  #language en-US "Indicates if SMM Profile will be enabled. If enabled, instruction executions in and data accesses to memory outside of SMRAM will be logged. This PCD is only for validation purpose. It should be set to false in production.<BR><BR>\n"
                                                                               "TRUE  - SMM Profile will be enabled.<BR>\n"
                                                                               "FALSE - SMM Profile will be disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProfileRingBuffer_PROMPT  #language en-US "The SMM profile log buffer is a ring buffer"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmProfileRingBuffer_HELP  #language en-US "Indicates if the SMM profile log buffer is a ring buffer. If disabled, no additional log can be done when the buffer is full.<BR><BR>\n"
                                                                                   "TRUE  - the SMM profile log buffer is a ring buffer.<BR>\n"
                                                                                   "FALSE - the SMM profile log buffer is a normal buffer.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUncacheCpuSyncData_PROMPT  #language en-US "SMM MP sync data resides in un-cached RAM"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmUncacheCpuSyncData_HELP  #language en-US "Indicates if SMM MP sync data resides in un-cached RAM.<BR><BR>\n"
                                                                                    "TRUE  - SMM MP sync data will be resided in un-cached RAM.<BR>\n"
                                                                                    "FALSE - SMM MP sync data will be resided in cached RAM.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHotPlugSupport_PROMPT  #language en-US "SMM CPU hot-plug"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHotPlugSupport_HELP  #language en-US "Enable CPU SMM hot-plug?<BR><BR>\n"
                                                                             "TRUE  - enabled.<BR>\n"
                                                                             "FALSE - disabled.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmFeatureControlMsrLock_PROMPT  #language en-US "Lock SMM Feature Control MSR"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSmmFeatureControlMsrLock_HELP  #language en-US "Lock SMM Feature Control MSR?<BR><BR>\n"
                                                                                       "TRUE  - locked.<BR>\n"
                                                                                       "FALSE - unlocked.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureCapability_PROMPT  #language en-US "Processor feature capabilities"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureCapability_HELP  #language en-US "Indicates processor feature capabilities, each bit corresponding to a specific feature."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureSetting_PROMPT  #language en-US "Actual processor feature settings"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureSetting_HELP  #language en-US "Specifies actual settings for processor features, each bit corresponding to a specific feature."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureCapabilityEx1_PROMPT  #language en-US "Processor feature extension1 capabilities"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureCapabilityEx1_HELP  #language en-US "Indicates processor feature capabilities, each bit corresponding to a specific feature."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureSettingEx1_PROMPT  #language en-US "Actual processor feature extension1 settings"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuProcessorFeatureSettingEx1_HELP  #language en-US "Specifies actual settings for processor features, each bit corresponding to a specific feature."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuConfigContextBuffer_PROMPT  #language en-US "The pointer to CPU Configuration Context Buffer"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuConfigContextBuffer_HELP  #language en-US "Contains the pointer to CPU Configuration Context Buffer defined in the CpuConfigLib."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuCallbackSignal_PROMPT  #language en-US "PCD for CPU callback signal"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuCallbackSignal_HELP  #language en-US "Used for a callback mechanism for the CPU MP driver. The CPU MP driver will set this PCD at pre-defined points. If there is callback function registered on it, the callback function will be triggered, and it may change the value of PcdCpuCallbackSignal."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuFrequencyLists_PROMPT  #language en-US "Platform CPU frequency lists"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuFrequencyLists_HELP  #language en-US "Platform CPU frequency lists (not used)."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuSocketCount_PROMPT  #language en-US "The number of CPU sockets in the platform"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuSocketCount_HELP  #language en-US "Specifies the number of CPU sockets in the platform."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuSocketNames_PROMPT  #language en-US "The name of each CPU socket"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuSocketNames_HELP  #language en-US "Contains the pointer to a pointer array, of which each item points to a unicode string of CPU socket name."

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuAssetTags_PROMPT  #language en-US "The asset tag of each CPU socket"

#string STR_gEfiCpuTokenSpaceGuid_PcdPlatformCpuAssetTags_HELP  #language en-US "Contains the pointer to a pointer array, of which each item points to a unicode string of CPU asset tag."

#string STR_gEfiCpuTokenSpaceGuid_PcdIsPowerOnReset_PROMPT  #language en-US "Current boot is a power-on reset"

#string STR_gEfiCpuTokenSpaceGuid_PcdIsPowerOnReset_HELP  #language en-US "Indicates if the current boot is a power-on reset.<BR><BR>\n"
                                                                          "TRUE  - Current boot is a power-on reset.<BR>\n"
                                                                          "FALSE - Current boot is not a power-on reset.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPageTableAddress_PROMPT  #language en-US "CPU page table address"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPageTableAddress_HELP  #language en-US "CPU page table address (not used)."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMtrrTableAddress_PROMPT  #language en-US "The pointer to a MTRR table buffer"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuMtrrTableAddress_HELP  #language en-US "Contains the pointer to a MTRR table buffer of structure MTRR_SETTINGS."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuS3DataAddress_PROMPT  #language en-US "The pointer to a CPU S3 data buffer"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuS3DataAddress_HELP  #language en-US "Contains the pointer to a CPU S3 data buffer of structure ACPI_CPU_DATA."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSocketId_PROMPT  #language en-US "The pointer to a new socket ID buffer"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSocketId_HELP  #language en-US "Contains the pointer to a buffer where new socket IDs to be assigned are stored."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHotPlugDataAddress_PROMPT  #language en-US "The pointer to CPU Hot Plug Data"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuHotPlugDataAddress_HELP  #language en-US "Contains the pointer to a CPU Hot Plug Data structure if CPU hot-plug is supported."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuBroadwellFamilyFlag_PROMPT  #language en-US "CPU MP driver 5th Generation Intel(R) Core(TM) processor support."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuBroadwellFamilyFlag_HELP  #language en-US "Indicates if the support for 5th Generation Intel(R) Core(TM) processor family is included in the CPU\n"
                                                                                  "MP driver.<BR><BR>\n"
                                                                                  "TRUE  - The support for 5th Generation Intel(R) Core(TM) processor is included in the CPU MP driver.<BR>\n"
                                                                                  "FALSE - The support for 5th Generation Intel(R) Core(TM) processor is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSkylakeFamilyFlag_PROMPT  #language en-US "CPU MP driver 6th Generation Intel(R) Core(TM) processor support."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuSkylakeFamilyFlag_HELP  #language en-US "Indicates if the support for 6th Generation Intel(R) Core(TM) processor family is included in the CPU\n"
                                                                                "MP driver.<BR><BR>\n"
                                                                                "TRUE  - The support for 6th Generation Intel(R) Core(TM) processor is included in the CPU MP driver.<BR>\n"
                                                                                "FALSE - The support for 6th Generation Intel(R) Core(TM) processor is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuGoldmontFamilyFlag_PROMPT  #language en-US "CPU MP driver 16nm Intel(R) Atom(TM) processor family support."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuGoldmontFamilyFlag_HELP  #language en-US "Indicates if the support for 16nm Intel(R) Atom(TM) processor family is included in the CPU\n"
                                                                                 "MP driver.<BR><BR>\n"
                                                                                 "TRUE  - The support for 16nm Intel(R) Atom(TM) processor family is included in the CPU MP driver.<BR>\n"
                                                                                 "FALSE - The support for 16nm Intel(R) Atom(TM) processor family is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuKnightsLandingFamilyFlag_PROMPT  #language en-US "CPU MP driver 14nm Intel(R) Xeon Phi(TM) Coprocessor family support."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuKnightsLandingFamilyFlag_HELP  #language en-US "Indicates if the support for 14nm Intel(R) Xeon Phi(TM) Coprocessor family is included in the CPU MP driver.<BR><BR>\n"
                                                                                 "TRUE  - The support for 14nm Intel(R) Xeon Phi(TM) Coprocessor family is included in the CPU MP driver.<BR>\n"
                                                                                 "FALSE - The support for 14nm Intel(R) Xeon Phi(TM) Coprocessor family is not included in the CPU MP driver.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnableIaUntrustedModeFlag_PROMPT  #language en-US "Enabled the IA untrusted lock feature."

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuEnableIaUntrustedModeFlag_HELP  #language en-US "Whether to set the IA untrusted lock feature of SAI-capable processors.\n"
                                                                                        "TRUE  - IA untrusted lock feature is supported.<BR>\n"
                                                                                        "FALSE - IA untrusted lock feature is not supported.<BR>"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPeciDownstreamWriteFlag_PROMPT  #language en-US "CPU MP driver Peci Downstream Write feature support"

#string STR_gEfiCpuTokenSpaceGuid_PcdCpuPeciDownstreamWriteFlag_HELP  #language en-US "Indicates if the support for Peci Downstream Write feature is included in the CPU MP driver.<BR><BR>\n"
                                                                                       "TRUE  - The support for Peci Downstream Write feature is included in the CPU MP driver.<BR>\n"
                                                                                       "FALSE - The support for Peci Downstream Write feature is not included in the CPU MP driver.<BR>"

